Revit 2026 API

# ExporterIFCGetFamilyName Method

---

Gets the name of the element assigned to the current export state.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string GetFamilyName()
```
```vb
Public Function GetFamilyName As String
```
```cpp
public:
String^ GetFamilyName()
```
```fsharp
member GetFamilyName : unit -> string
```

#### Return Value

String The family name.

The family name is prepared for use in IFC output during the call to PushExportState().

#### Reference

ExporterIFC Class

Autodesk.Revit.DB.IFC Namespace